app/controllers/exam_demo_controller.rb

  def index
    @counties =School.uniq.pluck(:county)
    @cschools =Hash.new
    @counties.each do |c|
      s =School.where(county: c).uniq.pluck(:school_name)
---
SELECT DISTINCT "school"."county" FROM "school"
SELECT  "school".* FROM "school" WHERE "school"."county" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT DISTINCT "school"."school_name" FROM "school" WHERE "school"."county" = $1  [["county", "Montgomery"]]

  def create
    @year =params[:fname]
    @sname =params[:sname]
    @s =School.find_by_school_name(@sname)
    @exams = []
    if (@s != nil)
      @exams = DataExam.where(state_school_id: @s.state_school_id).where(academic_year_start: @year)
---
SELECT  "school".* FROM "school" WHERE "school"."school_name" = $1 LIMIT $2  [["school_name", "NEXUS"], ["LIMIT", 1]]
SELECT "data_exam".* FROM "data_exam" WHERE "data_exam"."state_school_id" = $1 AND "data_exam"."academic_year_start" = $2  [["state_school_id", 6570], ["academic_year_start", 2014]]