app/controllers/home_page_controller.rb

SELECT DISTINCT "school"."county" FROM "school"
SELECT DISTINCT "district"."lea_name" FROM "district"
SELECT DISTINCT "school"."school_name" FROM "school"
SELECT DISTINCT "data_multi_year_grad_rate"."academic_year_start" FROM "data_multi_year_grad_rate"
---
  def index
    @counties =School.uniq.pluck(:county)
    @districts =District.uniq.pluck(:lea_name)
    @schools =School.uniq.pluck(:school_name)
    @years =DataMultiYearGradRate.uniq.pluck(:academic_year_start)