app/controllers/visualization3_controller.rb

  def show
    @year = params[:year]
    @school1 = params[:school1]
    @school2 = params[:school2]
    if (@school1 != nil && @school2 != nil && @year != nil)
      s1 = School.find_by_school_name(@school1)
      s2 = School.find_by_school_name(@school2)
      @attendanceRate1 = DataSchoolPerformanceMeasure.where(state_school_id: s1.state_school_id).where(academic_year_start: @year).uniq.pluck(:attendance_rate)
      @attendanceRate2 = DataSchoolPerformanceMeasure.where(state_school_id: s2.state_school_id).where(academic_year_start: @year).uniq.pluck(:attendance_rate)
      sc1 = DataMultiYearGradRate.where(state_school_id: s1.state_school_id).where(academic_year_start: @year).where(time_period: 4).uniq.pluck(:total_cohort)
      sg1 = DataMultiYearGradRate.where(state_school_id: s1.state_school_id).where(academic_year_start: @year).where(time_period: 4).uniq.pluck(:total_grads)
---
SELECT  "school".* FROM "school" WHERE "school"."school_name" = $1 LIMIT $2  [["school_name", "WINSTON HALL"], ["LIMIT", 1]]
SELECT DISTINCT "data_school_performance_measure"."attendance_rate" FROM "data_school_performance_measure" WHERE "data_school_performance_measure"."state_school_id" = $1 AND "data_school_performance_measure"."academic_year_start" = $2  [["state_school_id", 0], ["academic_year_start", 2014]]
SELECT DISTINCT "data_multi_year_grad_rate"."total_cohort" FROM "data_multi_year_grad_rate" WHERE "data_multi_year_grad_rate"."state_school_id" = $1 AND "data_multi_year_grad_rate"."academic_year_start" = $2 AND "data_multi_year_grad_rate"."time_period" = $3  [["state_school_id", 0], ["academic_year_start", 2014], ["time_period", 4]]
SELECT DISTINCT "data_multi_year_grad_rate"."total_grads" FROM "data_multi_year_grad_rate" WHERE "data_multi_year_grad_rate"."state_school_id" = $1 AND "data_multi_year_grad_rate"."academic_year_start" = $2 AND "data_multi_year_grad_rate"."time_period" = $3  [["state_school_id", 0], ["academic_year_start", 2014], ["time_period", 4]]