app/controllers/visualization2_controller.rb

  def show
    # parameters
    @year = params[:year]
    @district = params[:district]
    if (@district != nil && @year != nil) # checks fr params initialization
      d = District.find_by_lea_name(@district).state_lea_id #find the district
---
SELECT  "district".* FROM "district" WHERE "district"."lea_name" = $1 LIMIT $2  [["lea_name", "CARLISLE COMM SCHOOL DISTRICT"], ["LIMIT", 1]]