app/controllers/visualiztion3_controller.rb

SELECT  "school".* FROM "school" WHERE "school"."school_name" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def show
    @year = params[:year]
    @school1 = params[:school1]
    s1 = School.find_by_school_name(@school1)